cask_args appdir: "/Applications"

tap "arkweid/lefthook"
tap "eugenmayer/dockersync"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sanemat/font"
tap "yutomizutani/jc"

brew "act"
brew "actionlint"
brew "awsume"
brew "imath"
brew "autoconf"
brew "libtool"
brew "openssl@1.1"
brew "readline", link: true
brew "xz"
brew "awscli"
brew "aws-vault"
brew "bat"
brew "libffi"
brew "python@3.9"
brew "glib"
brew "cairo"
brew "deno"
brew "direnv"
brew "fd"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git", link: true, conflicts_with: ["git"]
brew "git-lfs"
brew "gnupg"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libxml2"
brew "luarocks"
brew "lua-language-server"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "mise"
brew "yarn"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "npm"
brew "pngpaste"
brew "pnpm"
brew "postgresql", restart_service: true
brew "protobuf"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "sheldon"
brew "starship"
brew "suzuki-shunsuke/ghalint/ghalint"
brew "hashicorp/tap/terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "unison"
brew "vim"
brew "universal-ctags"
brew "watchman"
brew "wget"
brew "yamllint"

if OS.mac?
  cask "alacritty"
  cask "chromedriver"
  cask "deepl"
  cask "docker"
  cask "discord"
  cask "firefox"
  cask "font-jetbrains-mono-nerd-font"
  cask "ghostty"
  cask "google-japanese-ime"
  cask "google-chrome"
  cask "gyazo"
  cask "imageoptim"
  cask "iterm2"
  cask "kindle"
  cask "muzzle"
  cask "raycast"
  cask "secuel-ace"
  cask "spotify"
  cask "sidekick"
  cask "slack"
  cask "visual-studio-code"
  cask "zoom"

  mas "Contrast", id: 1254981365
  mas "RunCat", id: 1429033973
  mas "Xcode", id: 497799835
  mas "LINE", id: 539883307
end
